# DATA PRE-PROCESSING

In [1]:
import pandas as pd
import numpy as np

In [2]:
import warnings
warnings.filterwarnings('ignore')

In [3]:
data=pd.read_csv('data.csv')

In [4]:
data.head()

         Date      Open      High       Low     Close    Volume company
0  15/05/1997  2.437500  2.500000  1.927083  1.958333  72156000  Amazon
1  16/05/1997  1.968750  1.979167  1.708333  1.729167  14700000  Amazon
2  19/05/1997  1.760417  1.770833  1.625000  1.708333   6106800  Amazon
3  20/05/1997  1.729167  1.750000  1.635417  1.635417   5467200  Amazon
4  21/05/1997  1.635417  1.645833  1.375000  1.427083  18853200  Amazon

In [5]:
data.shape

(26146, 7)

In [6]:
df=data.dropna()

In [7]:
df.columns

Index(['Date', 'Open', 'High', 'Low', 'Close', 'Volume', 'company'], dtype='object')

In [8]:
df.tail()

,Date,Open,High,Low,Close,Volume,company
26141,21/10/2022,50.000000,50.750000,49.549999,49.889999,51209029,Twitter
26142,24/10/2022,50.709999,51.860001,50.520000,51.520000,22987553,Twitter
26143,25/10/2022,52.415001,53.180000,52.200001,52.779999,35077848,Twitter
26144,26/10/2022,52.950001,53.500000,52.770000,53.349998,28064973,Twitter
26145,27/10/2022,53.910000,54.000000,53.700001,53.700001,136345128,Twitter

In [9]:
df.shape

(26146, 7)

In [10]:
df.size

183022

In [11]:
df.describe()

               Open          High           Low         Close        Volume
count  26146.000000  26146.000000  26146.000000  26146.000000  2.614600e+04
mean     485.367411    487.361867    483.191057    485.323802  6.827284e+06
std      496.170789    499.753847    492.092880    495.958489  1.321333e+07
min        0.377857      0.410714      0.346429      0.372857  0.000000e+00
25%       45.462500     46.363929     44.549999     45.522500  8.991250e+03
50%      630.300000    630.950000    629.900000    630.350000  2.267300e+06
75%      685.550000    686.000000    685.087500    685.550000  8.640650e+06
max     3744.000000   3773.080078   3696.790039   3731.409912  3.234140e+08

In [12]:
df.corr()

ValueError: could not convert string to float: '15/05/1997'

In [ ]:
df.info()

In [ ]:
df.isnull()

In [ ]:
df.isnull().sum()

In [ ]:
df['Close'].unique()

In [ ]:
df['company'].unique()

In [ ]:
df['company'].value_counts()

In [ ]:
df.duplicated()

In [ ]:
sum(df.duplicated())

Before Label Encoding

In [ ]:
df.head()

In [ ]:
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()

df['company'] = le.fit_transform(df['company']).astype(int)

##### Afetr Label Encoding

In [ ]:
df.head()